[
    {
        "sentenceText":"You see two classmates laughing as you enter the room.",
        "negOption":"They are laughing about me.",
        "posOption":"They are laughing about something else.",
        "feedbackPositive":"Good! Not assuming negativity can help us in social settings.",
        "feedbackNegative":"Try again! Consider other possibilities."
    },
    {
        "sentenceText":"Your friend has not replied to your text message in 2 days.",
        "negOption":"They are ignoring me.",
        "posOption":"They might be busy.",
        "feedbackPositive":"Correct! People often have reasons unrelated to us.",
        "feedbackNegative":"Consider another explanation."
    },
    {
        "sentenceText":"You send a message to a friend, and they leave it on \"read\" without replying for several hours. ",
        "negOption":"They are annoyed at me.",
        "posOption":"They may have accidentally opened the message unknowingly.",
        "feedbackPositive":"That's right! There are unforeseen circumstances that could explain behaviour.",
        "feedbackNegative":"Don’t assume the worst! Consider other possibilities."
    },
    {
        "sentenceText":"You walked past someone you recognise but they did not acknowledge you",
        "negOption":"They purposefully ignored me.",
        "posOption":"They were probably distracted.",
        "feedbackPositive":"Yes, people's behaviours are not always attributed to you. ",
        "feedbackNegative":"There may be other impersonal reasons for people's behaviours."
    },
    {
        "sentenceText":"During a group conversation, you make a joke, but no one immediately laughs or responds.",
        "negOption":"They think I'm not funny.",
        "posOption":"They needed some time to process the joke. ",
        "feedbackPositive":"True! Sometimes people need processing time. ",
        "feedbackNegative":"Try again! It might not have been a negative evaluation of you."
    },
    {
        "sentenceText":"You walk into a room where a few acquaintances are talking, and they briefly pause when they see you. ",
        "negOption":"They were talking about me and stopped because I arrived.",
        "posOption":"They just naturally paused in their conversation. ",
        "feedbackPositive":"Good! These things are often coincidences.",
        "feedbackNegative":"Try looking for an alterantive reason."
    },
    {
        "sentenceText":"You post a photo on social media, and it receives significantly fewer likes and comments than usual.",
        "negOption":"People find me uninteresting. ",
        "posOption":"The algorithm might not have shown my post to many people. ",
        "feedbackPositive":"Yep! External circumstances can influence situations.",
        "feedbackNegative":"Consider that external, non-personal factors might explain why. "
    },
    {
        "sentenceText":"In class, you contribute an idea, but the response from others is neutral or noncommittal. ",
        "negOption":"My idea was bad, and people don't respect my input.",
        "posOption":"They might need time to think about it. ",
        "feedbackPositive":"Great! People sometimes need time to reflect before responding.",
        "feedbackNegative":"Try again! Neutral reactions don't wait mean disapproval. "
    },
    {
        "sentenceText":"You text a friend asking if they want to hang out, and they reply with \"maybe, I'll let you know\" but never follow up. ",
        "negOption":"They don't actually want to see me. ",
        "posOption":"They are unsure of their upcoming schedule. ",
        "feedbackPositive":"Correct! People often have other things going on. ",
        "feedbackNegative":"Consider other possibilities before assuming rejection."
    },
    {
        "sentenceText":"Someone you recently met at a social event does not seem to recognise you when you see them again.",
        "negOption":"I wasn't memorable, and they do not want to acknowledge me. ",
        "posOption":"They probably just forgot because it has been long since I last saw them.",
        "feedbackPositive":"Right! Memory varies, and a friendly reminder can help. ",
        "feedbackNegative":"Don't take it personally, consider the limitations of human memory."
    },
    {
        "sentenceText":"You ask a question in an online group chat, and everyone sees it, but no one responds.",
        "negOption":"They are ignoring me because they don't value my input. ",
        "posOption":"They might not have an answer to the question.",
        "feedbackPositive":"That's right! Sometimes, people are uncertain about their replies.",
        "feedbackNegative":"Try again! Lack of response does not mean rejection."
    },
    {
        "sentenceText":"While telling a story in a group, you notice that some people look away or check their phones.",
        "negOption":"They're bored and don't care about what I'm saying. ",
        "posOption":"They might be dealing with something else. ",
        "feedbackPositive":"Yes! People often face external situations that have nothing to do with you.",
        "feedbackNegative":"Try again! Don’t assume disinterest too quickly."
    },
    {
        "sentenceText":"You invite a friend to an event, and they say they already have plans, but later you see them out with other people. ",
        "negOption":"They lied to avoid me.",
        "posOption":"They had a different social energy that day.",
        "feedbackPositive":"Correct! Social plans are complicated and can change. ",
        "feedbackNegative":"Consider that people have different social capacities on different days."
    },
    {
        "sentenceText":"At a social gathering, you notice two people whispering to each other and occasionally glancing in your direction. ",
        "negOption":"They are talking about me negatively.",
        "posOption":"They are talking about things unrelated to me.",
        "feedbackPositive":"Good! Conversations happen everywhere, everytime. ",
        "feedbackNegative":"Reconsider your choice. People's conversations are not always about us."
    },
    {
        "sentenceText":"After presenting a project to a new professor this semester, you receive feedback that is polite but lacks enthusiasm. ",
        "negOption":"They didn’t like my work but don't want to say it outright. ",
        "posOption":"The professor is a reserved person.",
        "feedbackPositive":"That's right! Personality traits influence behaviour.",
        "feedbackNegative":"Consider that neutrality does not mean criticism."
    },
    {
        "sentenceText":"You go on a first date, and afterward, the person takes longer than expected to text you. ",
        "negOption":"They aren't interested in me.",
        "posOption":"They might be busy or unsure of how to follow-up. ",
        "feedbackPositive":"Correct! Reply timings don’t always indicate interest levels. ",
        "feedbackNegative":"Refrain from assumption. People communicate in different ways."
    },
    {
        "sentenceText":"You notice that someone you've been dating has changed their texting style, becoming more brief and distant. ",
        "negOption":"They are losing interest in me.",
        "posOption":"They may be going through something personal.",
        "feedbackPositive":"Yes! External factors can affect communication styles. ",
        "feedbackNegative":"Try again! Changes in text patterns don’t always indicate disinterest."
    },
    {
        "sentenceText":"At a café, the barista greets the customer before you warmly but seems less friendly towards you. ",
        "negOption":"They don't like me or find me rude. ",
        "posOption":"They are more familiar with the other customer.",
        "feedbackPositive":"Good! Service workers interact differently with regular customers.",
        "feedbackNegative":"Don't take it personally, there are many factors at play. "
    },
    {
        "sentenceText":"You send a heartfelt message to a distant relative, and they respond with a short, generic reply. ",
        "negOption":"They find me cringey. ",
        "posOption":"They may not be emotionally expressive.",
        "feedbackPositive":"That’s right! Some people struggle with emotional responses.",
        "feedbackNegative":"Consider that people communicate in different ways."
    },
    {
        "sentenceText":"During a family gathering, relatives seem to be discussing something privately and don't include you. ",
        "negOption":"They are deliberately leaving me out. ",
        "posOption":"They are talking about something personal that is unrelated to me.",
        "feedbackPositive":"Correct! Not all private conversations are about exclusion.",
        "feedbackNegative":"Try again! People have different conversational dynamics."
    }
]